Revit 2024 API
FilterCategoryRule Methods
The FilterCategoryRule type exposes the following members.
Methods
Name | Description
AllCategoriesFilterable
 Checks that all of the given categories are filterable.
Dispose |  (Inherited from FilterRule.)
ElementPasses
 Derived classes override this method to implement the test that determines whether the given element passes this rule or not.
 (Inherited from FilterRule.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetCategories
 Gets the rule's categories.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetRuleParameter
 Returns the ElementId of the parameter associated to this FilterRule if there is one, or invalidElementId if there is no associated parameter.
 (Inherited from FilterRule.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
SetCategories
 Sets the rule's categories.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
FilterCategoryRule Class
Autodesk.Revit.DB Namespace